# merging ,joining,concatenating

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [5]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [6]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})    
two_keys1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
two_keys2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
left2 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K1'])

In [7]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [8]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [9]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# concatenation

In [10]:
conct_rows = pd.concat([df1,df2,df3])
conct_rows

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# merging allows to merge dataframes inrespect to the columns using a similar logic

In [11]:
pd.merge(left,right,on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [14]:
two_keys1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                         'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
two_keys2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [17]:
pd.merge(two_keys1,two_keys2, on =['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

# joining based of a similar index

In [19]:
left2.join(right2)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C3  D3
K2  A2  B2  C2  D2

In [20]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [21]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# operations - dont fall into any distinct category

In [23]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# information on unique values

In [25]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

# number of unique values

In [26]:
df['col2'].nunique ()

3

# how many times does each unique value appear

In [27]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# APPLYING FUNCTIONS

In [29]:
def times2(x):
    return x*2

In [30]:
df['col2_squared']=df ['col1'].apply(times2)

In [31]:
df

   col1  col2 col3  col2_squared
0     1   444  abc             2
1     2   555  def             4
2     3   666  ghi             6
3     4   444  xyz             8

In [32]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [46]:
def phonechecker (phone):
    phonenumber=11
    if len(phone) != phonenumber:
        print("Number Fake")
    else:
        print("Number Genuine")

In [47]:
phonechecker('12345678910')

Number Genuine

In [49]:
df['col2'].apply(phonechecker)

TypeError: object of type 'int' has no len()

In [ ]:
#get columns and index names

In [39]:
df.columns

Index(['col1', 'col2', 'col3', 'col2_squared'], dtype='object')

In [40]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [41]:
df

   col1  col2 col3  col2_squared
0     1   444  abc             2
1     2   555  def             4
2     3   666  ghi             6
3     4   444  xyz             8

In [42]:
df.sort_values(by='col2') #inplace=false by and ascending =True

   col1  col2 col3  col2_squared
0     1   444  abc             2
3     4   444  xyz             8
1     2   555  def             4
2     3   666  ghi             6

In [50]:
df.sort_values(by='col2',ascending =True)

   col1  col2 col3  col2_squared
0     1   444  abc             2
3     4   444  xyz             8
1     2   555  def             4
2     3   666  ghi             6

In [51]:
df.sort_values(by='col2',inplace =False)

   col1  col2 col3  col2_squared
0     1   444  abc             2
3     4   444  xyz             8
1     2   555  def             4
2     3   666  ghi             6